Show / Hide Table of Contents
Namespace IdeaRS.OpenModel.Loading
Classes
CombiInput
Basic class combination
CombiInputEC
Combination according to EC in the model
CombiInputSIA
Combination according to SIA in the model
CombiItem
Combi item
CrossSectionComponentEdges
Cross-section component edges
LoadCase
Load case in the model
LoadGroup
Load group
LoadGroupEC
Load group for EC
LoadGroupSIA
Load group for SIA
LoadInPoint
Concentrated load
LoadOnLine
Load on line
LoadOnSurface
Load on surface
PointLoadOnLine
Load in specific point on line
ResultClass
ResultClass object
SelectionItemForResults
SelectionItemForResults
Settlement
Settlement of point support
StrainLoadOnLine
Linearly distributed generalized strain load along a line. Strain load is in local coordinate system and there are no possible eccentricities.
TemperatureLoadOnLine
Temperature load on line
Structs
LoadImpulse
LoadImpulse
StrainImpulse
Generalized strain load impulse.
Enums
LoadCaseSubType
Load case sub type
LoadCaseType
Load case type
LoadDirection
Direction of load
LoadGroupType
Load group type
LoadProjection
Type of load projection
LoadType
Type of load impuls
Relation
Relation
TemperatureDirection
Temperature direction
TypeCalculationCombiEC
Type of combination
TypeCalculationCombiSIA
Type of combination
TypeClassEvaluation
Load of evaluation
TypeDuration
Duration of load case
TypeOfCombiEC
Type of combination
TypeOfCombiSIA
Type of combination
TypeResultsClass
TypeResultsClass
TypeUpdateResultClass
TypeUpdateResultClass
VariableType
Variable type